app/controllers/friends_controller.rb

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save